app/Controllers/People.php

SELECT *
FROM `people`
---
    public function index()
    {
        return view('peoples', [
            'peoples' => $this->peopleModel->findAll()
        ]);

INSERT INTO `people` (`nome`, `idade`, `sexo`) VALUES ('aaaaaaaa', '22222', 'aaa')
UPDATE `people` SET `nome` = 'aaabbbbbbb', `idade` = '22', `sexo` = 'aaa'
WHERE `people`.`id` IN ('5')
---
    public function store()
    {
        if ($this->peopleModel->save($this->request->getPost())) {

SELECT *
FROM `people`
WHERE `people`.`id` = '5'
---
    public function edit($id)
    {
        return view('form', [
            'people' => $this->peopleModel->find($id)
        ]);